DataFrame

In [3]:
import pandas as pd

In [5]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]])
print(df)  # 엑셀 생각아면 편하다

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [6]:
import numpy as np

In [7]:
data_list = np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]])
df = pd.DataFrame(data_list)
print(df)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [8]:
data = np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9], [10, 11, 12]])
index_date = pd.date_range('2020-05-01', periods=4)
columns_list = ['A', 'B', 'C']
df = pd.DataFrame(data, index=index_date, columns=columns_list)
print(df)

             A   B   C
2020-05-01   1   2   3
2020-05-02   4   5   6
2020-05-03   7   8   9
2020-05-04  10  11  12

In [10]:
data = {'연도': [2015, 2016, 2016, 2017, 2017], 
        '지사': ['서울', '서울', '부산', '서울', '부산'],
        '고객 수': [200, 250, 150, 300, 200]}
df = pd.DataFrame(data)
print(df)

     연도  지사  고객 수
0  2015  서울   200
1  2016  서울   250
2  2016  부산   150
3  2017  서울   300
4  2017  부산   200

In [12]:
data = {'연도': [2015, 2016, 2016, 2017, 2017], 
        '지사': ['서울', '서울', '부산', '서울', '부산'],
        '고객 수': [200, 250, 150, 300, 200]}
df = pd.DataFrame(data, columns=['지사','연도','고객 수'])
print(df)

   지사    연도  고객 수
0  서울  2015   200
1  서울  2016   250
2  부산  2016   150
3  서울  2017   300
4  부산  2017   200

In [14]:
print(df.values) # numpy배열 type로 나온다

[['서울' 2015 200]
 ['서울' 2016 250]
 ['부산' 2016 150]
 ['서울' 2017 300]
 ['부산' 2017 200]]

In [15]:
s1 = pd.Series([1, 2, 3, 4, 5])
s2 = pd.Series([10, 20, 30, 40, 50])
print(s1 + s2)
print(s2 - s1)
print(s1 * s2)
print(s2 / s1)

0    11
1    22
2    33
3    44
4    55
dtype: int64
0     9
1    18
2    27
3    36
4    45
dtype: int64
0     10
1     40
2     90
3    160
4    250
dtype: int64
0    10.0
1    10.0
2    10.0
3    10.0
4    10.0
dtype: float64

In [16]:
s3 = pd.Series([1, 2, 3, 4])
s4 = pd.Series([10, 20, 30, 40, 50])
print(s3 + s4)

0    11.0
1    22.0
2    33.0
3    44.0
4     NaN
dtype: float64

In [17]:
data1 = {'A': [1, 2, 3, 4, 5],
         'B': [10, 20, 30, 40, 50],
         'C': [100, 200, 300, 400, 500]}
df1 = pd.DataFrame(data1)
print(df1)

data2 = {'A': [6, 7, 8],
         'B': [60, 70, 80],
         'C': [600, 700, 800]}
df2 = pd.DataFrame(data2)
print(df2)
print('='*20)
print(df1 + df2)

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500
   A   B    C
0  6  60  600
1  7  70  700
2  8  80  800
====================
      A      B       C
0   7.0   70.0   700.0
1   9.0   90.0   900.0
2  11.0  110.0  1100.0
3   NaN    NaN     NaN
4   NaN    NaN     NaN

In [18]:
table_data3 = {'봄':  [256.5, 264.3, 215.9, 223.2, 312.8],
              '여름': [770.6, 567.5, 599.8, 387.1, 446.2],
              '가을': [363.5, 231.2, 293.1, 247.7, 381.6],
              '겨울': [139.3, 59.9, 76.9, 109.1, 108.1]}
columns_list = ['봄', '여름', '가을', '겨울']
index_list = ['2012', '2013', '2014', '2015', '2016']

df3 = pd.DataFrame(table_data3, columns = columns_list, index = index_list)
print(df3)

          봄     여름     가을     겨울
2012  256.5  770.6  363.5  139.3
2013  264.3  567.5  231.2   59.9
2014  215.9  599.8  293.1   76.9
2015  223.2  387.1  247.7  109.1
2016  312.8  446.2  381.6  108.1

In [23]:
print(df3.mean()) # axis(축) = 0 디폴트 row에 평균을 구해라   ==>  (row,col) (5,4)  0번째는 row축을 의미

봄     254.54
여름    554.24
가을    303.42
겨울     98.66
dtype: float64

In [20]:
print(df3.std())

봄      38.628267
여름    148.888895
가을     67.358496
겨울     30.925523
dtype: float64

In [25]:
print(df3.mean(axis=1))  # axis연도 별로 나옴, columns에 평균을 구해아, numpy,tenserflow도 동일하 개념을 의미 ==>  (row,col) (5,4)  1번째는 col축을 의미

2012    382.475
2013    280.725
2014    296.425
2015    241.775
2016    312.175
dtype: float64

In [26]:
print(df3.std(axis=1))

2012    274.472128
2013    211.128782
2014    221.150739
2015    114.166760
2016    146.548658
dtype: float64

In [28]:
print(df.describe())  # 기본적인 통계를 보여줌

               연도        고객 수
count     5.00000    5.000000
mean   2016.20000  220.000000
std       0.83666   57.008771
min    2015.00000  150.000000
25%    2016.00000  200.000000
50%    2016.00000  200.000000
75%    2017.00000  250.000000
max    2017.00000  300.000000

In [30]:
print(df.info()) # 정보들이 다나옴

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   지사      5 non-null      object
 1   연도      5 non-null      int64
 2   고객 수    5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 248.0+ bytes
None

In [31]:
print(df.head())

   지사    연도  고객 수
0  서울  2015   200
1  서울  2016   250
2  부산  2016   150
3  서울  2017   300
4  부산  2017   200

In [32]:
df.head()

   지사    연도  고객 수
0  서울  2015   200
1  서울  2016   250
2  부산  2016   150
3  서울  2017   300
4  부산  2017   200

In [33]:
df.tail()

   지사    연도  고객 수
0  서울  2015   200
1  서울  2016   250
2  부산  2016   150
3  서울  2017   300
4  부산  2017   200

In [35]:
df.head(3)

   지사    연도  고객 수
0  서울  2015   200
1  서울  2016   250
2  부산  2016   150

In [36]:
KTX_data = {'경부선 KTX': [39060, 39896, 42005, 43621, 41702, 41266, 32427],
            '호남선 KTX': [7313, 6967, 6873, 6626, 8675, 10622, 9228],
            '경전선 KTX': [3627, 4168, 4088, 4424, 4606, 4984, 5570],
            '전라선 KTX': [309, 1771, 1954, 2244, 3146, 3945, 5766],
            '동해선 KTX': [np.nan,np.nan, np.nan, np.nan, 2395, 3786, 6667]}
col_list = ['경부선 KTX','호남선 KTX','경전선 KTX','전라선 KTX','동해선 KTX']
index_list = ['2011', '2012', '2013', '2014', '2015', '2016', '2017']

df_KTX = pd.DataFrame(KTX_data, columns = col_list, index = index_list)
print(df_KTX)

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    39060     7313     3627      309      NaN
2012    39896     6967     4168     1771      NaN
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0
2017    32427     9228     5570     5766   6667.0

In [37]:
print(df_KTX[1:2]) # 첨자로 찾기

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2012    39896     6967     4168     1771      NaN

In [38]:
print(df_KTX[2:5])

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0

In [39]:
print(df_KTX.loc['2011']) # 이름을 찍접 사용할때

경부선 KTX    39060.0
호남선 KTX     7313.0
경전선 KTX     3627.0
전라선 KTX      309.0
동해선 KTX        NaN
Name: 2011, dtype: float64

In [41]:
print(df_KTX.loc['2013':'2016']) #2016이 포함이 된다.

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0

In [42]:
df_KTX

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    39060     7313     3627      309      NaN
2012    39896     6967     4168     1771      NaN
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0
2017    32427     9228     5570     5766   6667.0

In [43]:
print(df_KTX['경부선 KTX'])

2011    39060
2012    39896
2013    42005
2014    43621
2015    41702
2016    41266
2017    32427
Name: 경부선 KTX, dtype: int64

In [45]:
print(df_KTX['경부선 KTX']['2013':'2016'])

2013    42005
2014    43621
2015    41702
2016    41266
Name: 경부선 KTX, dtype: int64

In [46]:
print(df_KTX['경부선 KTX'][2:6])

2013    42005
2014    43621
2015    41702
2016    41266
Name: 경부선 KTX, dtype: int64

In [47]:
print(df_KTX.loc['2016']['호남선 KTX'])
print('='*40)
print(df_KTX.loc['2016','호남선 KTX'])
print('='*40)
print(df_KTX['호남선 KTX']['2016'])
print('='*40)
print(df_KTX['호남선 KTX'][5])
print('='*40)
print(df_KTX['호남선 KTX'].loc['2016'])

10622.0
========================================
10622
========================================
10622
========================================
10622
========================================
10622

In [50]:
df_KTX.T #전치 행과 열을 바꿈

            2011     2012     2013     2014     2015     2016     2017
경부선 KTX  39060.0  39896.0  42005.0  43621.0  41702.0  41266.0  32427.0
호남선 KTX   7313.0   6967.0   6873.0   6626.0   8675.0  10622.0   9228.0
경전선 KTX   3627.0   4168.0   4088.0   4424.0   4606.0   4984.0   5570.0
전라선 KTX    309.0   1771.0   1954.0   2244.0   3146.0   3945.0   5766.0
동해선 KTX      NaN      NaN      NaN      NaN   2395.0   3786.0   6667.0

In [60]:
df1 = pd.DataFrame({'Class1': [95, 92, 98, 100],
                    'Class2': [91, 93, 97, 99]})
print(df1)

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      99

In [61]:
df2 = pd.DataFrame({'Class1': [87, 89],
                    'Class2': [85, 90]})

print(df2)

   Class1  Class2
0      87      85
1      89      90

In [62]:
df1.append(df2)  # 사용못함

/var/folders/xf/2ksg4w5n0598m6cy2w06tnpw0000gn/T/ipykernel_55491/3020366529.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1.append(df2)  # 사용못함

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      99
0      87      85
1      89      90

In [63]:
pd.concat([df1,df2])

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      99
0      87      85
1      89      90

In [65]:
pd.concat([df1,df2], ignore_index = True) ##ignore_index 창이면 기존에 인덱스 무시해라

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      99
4      87      85
5      89      90

In [67]:
df3 = pd.DataFrame({'Class1': [96, 83]})
print(df3)

   Class1
0      96
1      83

In [68]:
print(pd.concat([df2, df3], ignore_index=True))

   Class1  Class2
0      87    85.0
1      89    90.0
2      96     NaN
3      83     NaN

In [69]:
df4 = pd.DataFrame({'Class3': [93, 91, 95, 98]})
print(df4)

   Class3
0      93
1      91
2      95
3      98

In [71]:
print(df1.join(df4)) #옆으로 붙이기, index기준으로 붙임

   Class1  Class2  Class3
0      95      91      93
1      92      93      91
2      98      97      95
3     100      99      98

In [72]:
index_label = ['a','b','c','d']
df1a = pd.DataFrame({'Class1': [95, 92, 98, 100],
                    'Class2': [91, 93, 97, 99]}, index= index_label)
df4a = pd.DataFrame({'Class3': [93, 91, 95, 98]}, index=index_label)

print(df1a.join(df4a))

   Class1  Class2  Class3
a      95      91      93
b      92      93      91
c      98      97      95
d     100      99      98

In [73]:
df5 = pd.DataFrame({'Class4': [82, 92]})
print(df1.join(df5))

   Class1  Class2  Class4
0      95      91    82.0
1      92      93    92.0
2      98      97     NaN
3     100      99     NaN

In [74]:
df_A_B = pd.DataFrame({'판매월': ['1월', '2월', '3월', '4월'],
                       '제품A': [100, 150, 200, 130],
                       '제품B': [90, 110, 140, 170]})
print(df_A_B)

  판매월  제품A  제품B
0  1월  100   90
1  2월  150  110
2  3월  200  140
3  4월  130  170

In [75]:
df_C_D = pd.DataFrame({'판매월': ['1월', '2월', '3월', '4월'],
                       '제품C': [112, 141, 203, 134],
                       '제품D': [90, 110, 140, 170]})
print(df_C_D)

  판매월  제품C  제품D
0  1월  112   90
1  2월  141  110
2  3월  203  140
3  4월  134  170

In [77]:
print(df_A_B.merge(df_C_D)) #merge 동일 한 컬럼 기준으로 붙임

  판매월  제품A  제품B  제품C  제품D
0  1월  100   90  112   90
1  2월  150  110  141  110
2  3월  200  140  203  140
3  4월  130  170  134  170

In [78]:
df_left = pd.DataFrame({'key':['A','B','C'], 'left': [1, 2, 3]})
print(df_left)
print('='*40)
df_right = pd.DataFrame({'key':['A','B','D'], 'right': [4, 5, 6]})
print(df_right)

  key  left
0   A     1
1   B     2
2   C     3
========================================
  key  right
0   A      4
1   B      5
2   D      6

In [79]:
print(df_left.merge(df_right, how='left', on = 'key')) #왼쪽기준

  key  left  right
0   A     1    4.0
1   B     2    5.0
2   C     3    NaN

In [80]:
print(df_left.merge(df_right, how='right', on = 'key')) #오른쪽기준

  key  left  right
0   A   1.0      4
1   B   2.0      5
2   D   NaN      6

In [81]:
print(df_left.merge(df_right, how='outer', on = 'key')) #양쪽다

  key  left  right
0   A   1.0    4.0
1   B   2.0    5.0
2   C   3.0    NaN
3   D   NaN    6.0

In [83]:
print(df_left.merge(df_right, how='inner', on = 'key')) #겹치는 값만

  key  left  right
0   A     1      4
1   B     2      5

In [84]:
data = {'연도': [2015, 2016, 2016, 2017, 2017], 
'지사': ['서울', '서울', '부산', '서울', '부산'],
    '고객 수': [200, 250, 150, 300, 200]}
df = pd.DataFrame(data, columns=['지사','연도', '고객 수'])
print(df)

   지사    연도  고객 수
0  서울  2015   200
1  서울  2016   250
2  부산  2016   150
3  서울  2017   300
4  부산  2017   200

In [87]:
#row 추가 방법
row = ['대전', 2018, 500]
df = df.append(pd.Series(row, index=df.columns), ignore_index=True)
print(df)

   지사    연도  고객 수
0  서울  2015   200
1  서울  2016   250
2  부산  2016   150
3  서울  2017   300
4  부산  2017   200
5  대전  2018   500

/var/folders/xf/2ksg4w5n0598m6cy2w06tnpw0000gn/T/ipykernel_55491/2796316203.py:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(pd.Series(row, index=df.columns), ignore_index=True)

### csv(comma separated values)

In [108]:
df = pd.read_csv('data/sea_rain.csv')  #자체를 utf8로 만들거나 판다스에서 utf8로 변경

In [92]:
df = pd.read_csv('data/sea_rain.csv', encoding='cp949')

In [109]:
print(df)

     연도       동해       남해       서해       전체
0  1996  17.4629  17.2288  14.4360  15.9067
1  1997  17.4116  17.4092  14.8248  16.1526
2  1998  17.5944  18.0110  15.2512  16.6044
3  1999  18.1495  18.3175  14.8979  16.6284
4  2000  17.9288  18.1766  15.0504  16.6178

In [110]:
temp = pd.read_csv('data/sea_rain2.csv',sep=' ')
print(temp)

     연도       동해       남해       서해       전체
0  1996  17.4629  17.2288  14.4360  15.9067
1  1997  17.4116  17.4092  14.8248  16.1526
2  1998  17.5944  18.0110  15.2512  16.6044
3  1999  18.1495  18.3175  14.8979  16.6284
4  2000  17.9288  18.1766  15.0504  16.6178

In [111]:
temp = pd.read_csv('data/sea_rain2.csv',sep=' ',index_col='연도')
print(temp)

           동해       남해       서해       전체
연도
1996  17.4629  17.2288  14.4360  15.9067
1997  17.4116  17.4092  14.8248  16.1526
1998  17.5944  18.0110  15.2512  16.6044
1999  18.1495  18.3175  14.8979  16.6284
2000  17.9288  18.1766  15.0504  16.6178

In [112]:
df_WH = pd.DataFrame({'Weight':[62, 67, 55, 74],
                      'Height':[165, 177, 160, 180]},
                       index=['ID_1', 'ID_2', 'ID_3', 'ID_4'])
df_WH.index.name = 'User'
print(df_WH)

      Weight  Height
User
ID_1      62     165
ID_2      67     177
ID_3      55     160
ID_4      74     180

In [113]:
bmi = df_WH['Weight']/(df_WH['Height']/100)**2

In [116]:
df_WH['BMI'] = bmi  #컬럼 이름 주고

In [117]:
print(df_WH)

      Weight  Height        BMI
User
ID_1      62     165  22.773186
ID_2      67     177  21.385936
ID_3      55     160  21.484375
ID_4      74     180  22.839506

In [118]:
df_WH.to_csv('data/bmi.csv')

In [120]:
df_WH.to_csv('data/bmi.csv', sep='/')